#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-04d777dd5598358c3]
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-09e4a91df5d5c8e31]
aws_sns_topic.devops-sns: Refreshing state... [id=arn:aws:sns:us-east-1:099608972557:poc-template-sns-prd]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
aws_sns_topic_subscription.futura-sns-email: Refreshing state... [id=arn:aws:sns:us-east-1:099608972557:poc-template-sns-prd:dcb3ab3c-c8f0-4751-9883-06eab30fc740]
module.vpc.aws_internet_gateway_attachment.igw-attachment: Refreshing state... [id=igw-04d777dd5598358c3:vpc-09e4a91df5d5c8e31]
module.vpc.aws_subnet.private-subnets[0]: Refreshing state... [id=subnet-015ce551ca796872f]
module.vpc.aws_route_table.rt-pub: Refreshing state... [id=rtb-01efb139cf828e15a]
module.vpc.aws_subnet.private-subnets[1]: Refreshing state... [id=subnet-0f9a752225ea836a3]
module.vpc.aws_subnet.public-subnets[1]: Refreshing state... [id=subnet-02c742c6f18ab3dc2]
module.vpc.aws_subnet.public-subnets[0]: Refreshing state... [id=subnet-00b052e304018b520]
aws_security_group.sg-host: Refreshing state... [id=sg-0ddb190db91b8ff4d]
module.vpc.aws_route_table_association.rt-association-pub[1]: Refreshing state... [id=rtbassoc-0a34a3b8e4c0e3269]
module.vpc.aws_route_table_association.rt-association-pub[0]: Refreshing state... [id=rtbassoc-037ecd0ae821f4593]
module.instance-client.aws_instance.instance: Refreshing state... [id=i-0b1f9f1b30c84273a]
module.instance.aws_instance.instance: Refreshing state... [id=i-0311608a54c882b58]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.sg-client will be created
  + resource "aws_security_group" "sg-client" {
      + arn                    = (known after apply)
      + description            = "Habilita acesso ao client"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "179.125.170.200/32",
                ]
              + description      = "libera HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "179.125.170.200/32",
                ]
              + description      = "libera SSH para instance ip particular"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "poc-template-client-sg-prd"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "prd"
          + "Name"        = "poc-template-client-sg-prd"
          + "Project"     = "poc-template"
        }
      + tags_all               = {
          + "CreatedAt"   = "2023-12-12"
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "poc-template-client-sg-prd"
          + "Owner"       = "Rogerio Calixto"
          + "Project"     = "poc-template"
        }
      + vpc_id                 = "vpc-09e4a91df5d5c8e31"
    }

  # aws_security_group.sg-host must be replaced
-/+ resource "aws_security_group" "sg-host" {
      ~ arn                    = "arn:aws:ec2:us-east-1:099608972557:security-group/sg-0ddb190db91b8ff4d" -> (known after apply)
      ~ id                     = "sg-0ddb190db91b8ff4d" -> (known after apply)
      ~ name                   = "poc-template-sg-host" -> "poc-template-server-sg-prd" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "099608972557" -> (known after apply)
      ~ tags                   = {
          ~ "Name"        = "poc-template-server-sg" -> "poc-template-server-sg-prd"
            # (2 unchanged elements hidden)
        }
      ~ tags_all               = {
          ~ "Name"        = "poc-template-server-sg" -> "poc-template-server-sg-prd"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.instance.aws_instance.instance will be updated in-place
  ~ resource "aws_instance" "instance" {
        id                                   = "i-0311608a54c882b58"
      ~ tags                                 = {
          ~ "Name"        = "poc-template-server" -> "poc-template-server-prd"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                             = {
          ~ "Name"        = "poc-template-server" -> "poc-template-server-prd"
            # (2 unchanged elements hidden)
        }
      ~ vpc_security_group_ids               = [
          - "sg-0ddb190db91b8ff4d",
        ] -> (known after apply)
        # (30 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # module.instance-client.aws_instance.instance will be updated in-place
  ~ resource "aws_instance" "instance" {
        id                                   = "i-0b1f9f1b30c84273a"
      ~ tags                                 = {
          ~ "Name"        = "poc-template-client" -> "poc-template-client-prd"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                             = {
          ~ "Name"        = "poc-template-client" -> "poc-template-client-prd"
            # (2 unchanged elements hidden)
        }
      ~ vpc_security_group_ids               = [
          - "sg-0ddb190db91b8ff4d",
        ] -> (known after apply)
        # (30 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ sg-id = "sg-0ddb190db91b8ff4d" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```
</details>
*Pushed by: @rogerio-calixto, Action: `pull_request`*